Revit 2026 API

# BuiltInFailuresLegendFailures Class

---

Failures about Legend.

SystemObject Autodesk.Revit.DBBuiltInFailuresLegendFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class LegendFailures
```
```vb
Public NotInheritable Class LegendFailures
```
```cpp
public ref class LegendFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LegendFailures = class end
```

The BuiltInFailuresLegendFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LegendComponentBadViewType | Legend Components may only be placed in Legends |
|  | LegendComponentNotVisible | The component you have selected is not visible in the selected view. |

#### Reference

Autodesk.Revit.DB Namespace